Zakaria-Rafi/mspm0_ti/MSPM0G3507/TLC5926_LED_Driver/Debug/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000



/* Defines for PWM_1 */
#define PWM_1_INST                                                         TIMA0
#define PWM_1_INST_IRQHandler                                   TIMA0_IRQHandler
#define PWM_1_INST_INT_IRQN                                     (TIMA0_INT_IRQn)
#define PWM_1_INST_CLK_FREQ                                               200000
/* GPIO defines for channel 0 */
#define GPIO_PWM_1_C0_PORT                                                 GPIOA
#define GPIO_PWM_1_C0_PIN                                          DL_GPIO_PIN_0
#define GPIO_PWM_1_C0_IOMUX                                       (IOMUX_PINCM1)
#define GPIO_PWM_1_C0_IOMUX_FUNC                      IOMUX_PINCM1_PF_TIMA0_CCP0
#define GPIO_PWM_1_C0_IDX                                    DL_TIMER_CC_0_INDEX



/* Defines for TIMER_0 */
#define TIMER_0_INST                                                     (TIMA1)
#define TIMER_0_INST_IRQHandler                                 TIMA1_IRQHandler
#define TIMER_0_INST_INT_IRQN                                   (TIMA1_INT_IRQn)
#define TIMER_0_INST_LOAD_VALUE                                            (31U)
#define TIMER_0_REPEAT_COUNT_2                                               (1)




/* Port definition for Pin Group GPIO_SDI */
#define GPIO_SDI_PORT                                                    (GPIOA)

/* Defines for PIN_SDI: GPIOA.5 with pinCMx 10 on package pin 9 */
#define GPIO_SDI_PIN_SDI_PIN                                     (DL_GPIO_PIN_5)
#define GPIO_SDI_PIN_SDI_IOMUX                                   (IOMUX_PINCM10)
/* Port definition for Pin Group GPIO_CLK */
#define GPIO_CLK_PORT                                                    (GPIOA)

/* Defines for PIN_CLK: GPIOA.6 with pinCMx 11 on package pin 10 */
#define GPIO_CLK_PIN_CLK_PIN                                     (DL_GPIO_PIN_6)
#define GPIO_CLK_PIN_CLK_IOMUX                                   (IOMUX_PINCM11)
/* Port definition for Pin Group GPIO_LE */
#define GPIO_LE_PORT                                                     (GPIOA)

/* Defines for PIN_LE: GPIOA.7 with pinCMx 14 on package pin 11 */
#define GPIO_LE_PIN_LE_PIN                                       (DL_GPIO_PIN_7)
#define GPIO_LE_PIN_LE_IOMUX                                     (IOMUX_PINCM14)
/* Port definition for Pin Group GPIO_SDO */
#define GPIO_SDO_PORT                                                    (GPIOA)

/* Defines for PIN_SDO: GPIOA.8 with pinCMx 19 on package pin 12 */
#define GPIO_SDO_PIN_SDO_PIN                                     (DL_GPIO_PIN_8)
#define GPIO_SDO_PIN_SDO_IOMUX                                   (IOMUX_PINCM19)
/* Port definition for Pin Group GPIO_OE */
#define GPIO_OE_PORT                                                     (GPIOA)

/* Defines for PIN_OE: GPIOA.10 with pinCMx 21 on package pin 14 */
#define GPIO_OE_PIN_OE_PIN                                      (DL_GPIO_PIN_10)
#define GPIO_OE_PIN_OE_IOMUX                                     (IOMUX_PINCM21)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_PWM_1_init(void);
void SYSCFG_DL_TIMER_0_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
